---
type: Workset
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# Workset

`Autodesk.Revit.DB.Workset` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2015 Subscription Update | `public static Workset Create ( Document document , string name )` |
| Property | IsEditable | 2012 | `public bool IsEditable { get ; }` |
| Property | IsOpen | 2012 | `public bool IsOpen { get ; }` |
| Property | IsVisibleByDefault | 2012 | `public bool IsVisibleByDefault { get ; }` |
| Property | Kind | 2012 | `public WorksetKind Kind { get ; }` |